app/views/links/index.html.erb

SELECT COUNT(*) FROM "comments"  WHERE "comments"."link_id" = ?  [["link_id", 1]]
---
      <%= link_to link do %>
      <%= link.comments.count %>